#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

To view this run in a browser, visit:
https://app.terraform.io/app/deploymenttheory/terraform-jamfpro-demo/runs/run-x5FRZCMWpw83vMK5

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.jamfpro_category.jamfpro_category_001_data will be read during apply
  # (config refers to values not yet known)
 <= data "jamfpro_category" "jamfpro_category_001_data" {
      + id   = (known after apply)
      + name = (known after apply)
    }

  # data.jamfpro_package.jamfpro_package_002_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "jamfpro_package" "jamfpro_package_002_data" {
      + id   = "105"
      + name = (known after apply)
    }

  # jamfpro_category.jamfpro_category_001 will be created
  + resource "jamfpro_category" "jamfpro_category_001" {
      + id       = (known after apply)
      + name     = "tf-ghatest-category-01"
      + priority = 5
    }

  # jamfpro_package.jamfpro_package_002 will be updated in-place
  ~ resource "jamfpro_package" "jamfpro_package_002" {
      - category                      = "No category assigned" -> null
        id                            = "105"
        name                          = "tf-ghatest-package-suspiciouspackage"
        # (18 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + jamfpro_category_001_data_id   = (known after apply)
  + jamfpro_category_001_data_name = (known after apply)
  ~ jamfpro_package_002_data_name  = "tf-ghatest-package-suspiciouspackage" -> (known after apply)

Run status: planned and saved (confirmable)
Workspace is unlocked

```

</details>

*Pusher: @ShocOne, Action: `push`, Working Directory: `workload/terraform/jamfpro`, Workflow: `Create terraform plan`*